TransportManagementDevelop_KAT/Конфигурация/src/DataProcessors/гкс_ПриемкаТранспорта/гкс_ПриемкаТранспорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>гкс_ПриемкаТранспорта</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРегистрации</name>
    <type>
      <types>EnumRef.гкс_ТипРегистрации</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ВремяНахожденияТСНаПЛК/гкс_ВремяНахожденияТСНаПЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ВремяНахожденияТСНаПЛК</name>
  <resources>
    <name>ВремяВзвешенБрутто</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВремяВзвешенТара</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьОтклонение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Отклонение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяНаПЛК</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/DataProcessors/гкс_ПриемкаТранспорта/Forms/ФормаОтклонениеНормПогрузки/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ЭтоВызовИзФормыПричиныОтклоненияНормПогрузки") 
		И Параметры.ЭтоВызовИзФормыПричиныОтклоненияНормПогрузки Тогда
		
		Элементы.Готово.Заголовок = "Записать";
	КонецЕсли;
	
	ДокументРегистрации = Параметры.ДокументРегистрации;
	
	ИнициализироватьРеквизитыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	МинимальноДопустимаяДлинаКомментария = 5;
	Если СтрДлина(Комментарий) < МинимальноДопустимаяДлинаКомментария Тогда
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Комментарий не может быть меньше %1 символов'"), 
						МинимальноДопустимаяДлинаКомментария);
						
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, ,"Комментарий");
		Возврат;
	КонецЕсли;
	
	ЗаписатьДанныеПоРегистрации(ДокументРегистрации, Комментарий);
	Закрыть(Новый Структура("ПричинаОтклонения", Комментарий));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьРеквизитыФормы()
	ДанныеРегистрации =
		РегистрыСведений.гкс_ВремяНахожденияТСНаПЛК.ДанныеПоВремениНахожденияНаПЛК(ДокументРегистрации);
	ВремяПребыванияТС = ДанныеРегистрации.ВремяНаПЛК;
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура ЗаписатьДанныеПоРегистрации(ДокументРегистрации, Комментарий)
	РегистрыСведений.гкс_ВремяНахожденияТСНаПЛК.ОбновитьКомментарийОтклонения(ДокументРегистрации, Комментарий);		
КонецПроцедуры

#КонецОбласти
